In [42]:
import pandas as pd
import numpy as np

In [43]:
df= pd.DataFrame(np.arange(12).reshape(3,4), columns=['one','two','three','four'])

In [44]:
df

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11

In [45]:
df.drop('one', axis=1)  # axis=1 is column, drop column 'one'

   two  three  four
0    1      2     3
1    5      6     7
2    9     10    11

In [46]:
df.drop(1, axis=0)  #axis=0 is row, drop row '1'

   one  two  three  four
0    0    1      2     3
2    8    9     10    11

In [47]:
df

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11

In [48]:
df.mean(axis=0)  # mean of each column for all row, row is moving

one      4.0
two      5.0
three    6.0
four     7.0
dtype: float64

In [49]:
df.mean(axis=1) # mean of each row for all column, column is moving

0    1.5
1    5.5
2    9.5
dtype: float64

In [51]:
df

   one  two  three  four
0    0    1      2     3
1    4    5      6     7
2    8    9     10    11

In [56]:
def get_sum_value(x):
    return x['one']+x['two']+x['three']+x['four']
df['sum_value'] = df.apply(get_sum_value, axis=1)

In [57]:
df

   one  two  three  four  sum_value
0    0    1      2     3          6
1    4    5      6     7         22
2    8    9     10    11         38